[
      ["Reset"],
      [
        "Taurin, Wake Up!",
        "I'm coming!",
        "You convince yourself to part with the comforting warmth of your bed and tear the pelt that covered you during the night from your body. Immediately, you regret your decision, but still hurry to the chair in the corner of the small room that you share with your older brother to get your clothes. Even though spring has started, the mornings are still freezing cold. You look at your bed longingly for a few seconds, but then make your way downstairs. Your stomach is yearning for something to fill it, so breakfast seems like a very reasonable option. At least that is one thing to look forward to. Otherwise it will probably be another boring day in this village in the middle of nowhere. The thought of running away to the closest city has often crossed your mind, but you were never able to work up the courage to even talk about it with your friends. That way, daily chores around the household are all that you can probably expect from today. It is not like anything exciting ever happens here in Elsberry.",
        "As you walk down the stairs to the ground floor, the wooden steps creak under your feet, which you take to be quite unpleasant. Could the few beers from last night really have given you a hangover? Ridiculous! Still, it would probably be better to be more careful when Peter offers a bet. Downstairs, the dull smell of porridge greets you along with a worried look by your little sister. She is standing next to the steaming cauldron that contains the grayish slime that will constitute your breakfast. Your father, and older brother are already sitting on the small table next to the fire, shoveling the unappetizing substance into their mouths with crooked wooden spoons. You join them and enjoy the warmth of the oven fire on your back as you fill your stomach.",
        "Taurin, were you out drinking last night again? Take yourself your brother Cedric as an example. He went to bed early and got up this morning to come and help out your sister. He works hard at the glass factory every day. He is of real Mountainspring blood. He brings honor to the name of our clan. And I do not have to tell you how much we owe to our clan, right?",
        "Yes, Father." ,
        "I am happy to hear that then. Come on boy, eat up! The day is not waiting for us to get started. I have some things for you today, so listen carefully.  I need you to pick up an order that I placed with the smith in the south-east quarter. The money has already been paid, so just the stuff and leave. Then I need you to pick up the usual herbs for your mother. We are running out again and if we can not make her medicine, then… ", 
        "Well, you know...",
        "Anyways, before I forget it, I think, the time has come that we can afford some meat for our stew tonight, so go to the butcher and get us a chicken. Do you hear me, son? But watch out, you know the butcher is a Greenwood and we can not trust anyone with Greenwood blood one bit. Not a single bit, so watch out that he does not overcharge you. You understand that, son?",
        "Yes, Father." ,
        "Alright, then here take a bit of money, that should be enough. And if there is any change left to it, you better bring it home. If I see you around the tavern tonight, then God save you. We need to bring honor to the Mountainspring name. Do you hear me? The reputation of our clan is the most important thing, never forget that.", 
        "Yes, Father." ,
        "Well, then off you go. Nobody will ever wait on you, just because you feel like sitting around. And don’t stay any second longer in the South-Western quarter than necessary. It is Greenwood territory and we do not want anything to do with them. Just the meat and come back here. Ahh, tonight will be a feast.",
        "You slowly stand and go outside. The door creaks as you open it, but you do not even notice that anymore. It is not like it will be fixed any time soon. You step into the small square in front of your house. The air smells great this morning. So fresh! But you are more worried about the burning sensation the cold is creating in your hands, so you quickly stuff them into your pockets. Here we go: let’s survive another day.", 
        "You start moving across the small, circular square in front of your house. Your shoes get a bit dirty from the dust you kick up, but you have more important things on your mind. Like how to hands from turning purple. Suddenly somebody runs into your left side. As that person seems to have been running, you almost fall over, but are just barely able to catch yourself.",
        "Sorry, Taurin. I am in a bit in a hurry. Something’s down in the South-West quarter.",
        "In front of you stands a teenage boy with blond hair, a little puny for his age, but seemingly brimming with energy. Isn’t he the guy who runs errands for Eric, our clan leader? Why would he care about what happens in the South-West, Greenwood territory? But Erin is already on his way again, so there is no time for further questions. Still, this is quite unusual. Nothing important ever happens in this village.",
        "Should you follow the boy or first do your chores?"
      ],
      [
        "You don’t want anything to do with the Greenwoods and therefore nothing that happens in their part of the village. Anyways, if somebody sees you slacking off and tells your father, you would be in for a hard time, so you start walking again. To your left is the majestic house that Erin must have just come from: the leader of your Clan, Clan Mountainspring, lives right there. It is one of the few stone houses in the village, along with the small town hall and the unexpectedly big trading post run by the Greenwoods. The house goes over two stories and has skillful carvings framing the façade. But most impressive is the man that lives inside it: Eric Mountainspring. You have met him several times before and were always a bit intimidated by not only his size but also his sheer presence that commands attention whenever he enters the room. He is a good man though. He might be a bit harsh sometimes, but he has always acted kindly towards you. Your father owes a lot to him, so your existence has basically been granted through his mercy. Yes, Eric is a good man. You can be proud to be part of his clan.",
        "The smith is probably the closest, so you start with that. You keep walking between the smaller houses and cross the cobbled road that leads to the eastern exit of the village, passing into the South-Eastern Quarter. There is nothing much here except for the herbalist, tailor, and the mill. Oh and of course that second rate smith Tarik that you are going to right now. Everybody knows that Oscar Greenwood is a much better craftsman, but of course he is a Greenwood. And one cannot trust a Greenwood. That is what your father and Eric have taught you from when you were a child. They cannot be trusted. ",
        "You keep moving between somewhat rundown, wooden houses, kicking up dust from the narrow lane that you are walking on. In the background, you hear some chickens cackling, as you arrive at Tarik’s house. To your dismay you see that the fire has not been started yet and its owner seems to still be asleep. But you get lucky and right when you decide to turn around, the tall man with his gigantic beer belly walks out the door.",
        "Is that you Taurin? What do you want?",
        "Father sent me to collect an order that was supposed to be done today.",
        "Right, right that thing. Well, it’s not done yet. Come back later, there is still some stuff to do.",
        "But...",
        "No buts. I told your father it would be done today and it will be done today. But not so early in the morning.",
        "Still squinting due to the brightness of the sun, you see him going to work and starting up the fire. A little annoyed, but powerless, you turn around and grumble something about why you have to get up so early, when other people don’t do either. At least it is starting to get a bit warmer and your hands are becoming a more acceptable color again."
      ],
      [  
        "What a waste of time! Hopefully you will have more luck with the herbalist, a middle aged woman by the name of Rachel, brown hair, rather slim with a confusingly big nose, the clear sign of a witch. She only came to this village three years ago and set up shop in one of the abandoned houses in the South-East Quarter right along the big road that leads to the Southern gate. Nobody really trusts her, because of course you never know what these witches are brewing in their cauldrons at night. Your family, however, has become too dependent on her not to award a little bit of trust. Since your mother got very sick two years ago, you have been making trips to this house every few weeks to get medicine. Rachel always seems to be very concerned, but, in the end, if she really cared, she would have come to see your mother herself and cured her properly with her witchcraft instead of always just sending some herbs. Damn her.",
        "You keep moving between somewhat rundown, wooden houses, kicking up dust from the narrow lane that you are walking on. In the background, the chickes are still active in with their annoying cackling, as you arrive at Rachel’s house. You see the smoke coming out of the chimney in the roof and as soon as you enter the smell of green from all the herbs almost overwhelms you. Rachel is in the back, right corner, next to the fire, stirring something inside a cauldron.",
        "Wait a second, I'll be right there.",
        "You take a look around. Everytime you come here, you find some new interesting thing that is worth inquiring. This time it is a gigantic book on the counter. You go closer and take it into your hand. The weird letters in the front still don't make any sense to you. How much you wish you could read. But father says, there is no time for such nonsense, so you spend your days running errands and taking whatever small jobs are offered around the village. In the winter, that amounted to a looooot of wood chopping. You try to open the book, but in that moment, Rachel nabs it out of your fingers and places it in a shelf behind her.",
        "That is for another day, Taurin. For now, I presume you have come again for the medicine? Here, I thought you'd run out soon, so I have already prepared the package for you. How is your mother doing? Any change of her symptoms?",
        "No not really, she still lies in bed all day, looking at the ceiling, barely hearing what we say. The fever from the beginning is gone, but she still barely sleeps or eats. Nothing is getting better, things are only ever getting worse. And your herbs don't help at all. We give them to her and nothing happens. It has been two years!!! And she is not getting better. My little sister has to do all the household chores. And she is fourteen. This just isn't right...",
        "As you were talking you got more and more upset, raising your voice to almost shouting. Now, there she is again with that weird look in her eyes. Who does she think she is? You know that she could save your mom with her witchcraft, if she just wanted to. It's her fault that your mom is still sick and getting thinner and thinner. It's her fault that your mom will die.",
        "I am very sorry for you, Taurin. I promise, if your mom will keep taking these herbs, things will get better eventually. Please...",
        "A little bit angry, but mostly sad, you slam a some of the money your father gave you on top of the counter and grab the package. Next time, you will ask her to come see your mom for sure. Next time, you will and then she has to come. Next time. You turn around to leave, trying to hold back the tears.",
        "Oh and Taurin, do you have any idea what is going on in the South-West quarter? I've seen people run over there and back for the entire morning, something serious must have happened. I have to watch the fire here for a few more hours. If you find out what is going on, will you come by and tell me?",
        "With these words, you turn around and leave for the outside world again. The sun is starting to break through the clouds above and it is getting warmer. Your body is finally not so stiff from all the cold anymore. Last one: the Butcher"
      ],
      [
         "You cross the street and close in on the butcher's shop. This will be enough interaction with Greenwoods that you can allow yourself for today in order not to get taunted for it by your friends tonight in the tavern. Not that you would want to spend any time with them in the first place, of course. Greenwoods are dirty bastards that can not be trusted; every Mountainspring that is clear in their head knows that. With these thouhgts on your mind, you enter the place of the butcher and his wife. The ground floor has two entrances, one from the road that you just entered through, and one leading out to the small square at the center of the South-Western quarter. The butcher's wife is standing with roled up slieves behind the counter, looking out of the window next to the latter door. Seemingly observing some sort of extremely important proceeding outside. You make yourself noticed by walking around as loud as you can and she turns around to give you an annoyed look. As soon as she recognizes you that turns into in almost angry glare as she opens her mouth to speak with obvious animosity.",
        "And what do you want little Mountainspring?",
        "My Father has sent me to buy a chicken.",
        "Has he now? So why should I care that he has sent you. Do you have any intention of actually buying one as well?",
        "I don't understand what you mean. Didn't I just say...",
        "Listen little dipshit, if you come in here with your nose high like that and completely full of yourself, I don't want to see you any longer than necessary to get your money. So just say: I want to buy a chicken. I want to buy a chicken.",
        "Okay, okay. I want to buy a chicken.",
        "Now there you go little Mountainspring; that'll make 6 Bitcoin.",
        "Wait, wait, wait. That is two times more than last time. Last time I came here it was 3 Bitcoin. Why am I suddenly supposed to pay 6? I demand an explanation.",
        "You want an explanation? Then go to that door and take a little look outside. That's why.",
        "Very upset, but a bit too scared of a woman with a butcher's knife in her hand to straight up refuse, you turn to the door, open it and look outside.",
        "You see how the four village guards in full uniform are escorting Oscar Greenwood out of his house. It's not like they could really do anything to stop him, if he decided to resist, but the massive mountain of muscle that makes up the man renowned to be the best smith far and wide calmly walks in their middle with a mix of anger and superiority on his face. What might he have done? You notice Erin on the side of the small square your standing on and walk to him.",
        "Hey Erin, what happened here?",
        "Last night, Eric Jr., the son of our clan's leader, came here to pay a friendly visit to the smith's daughter. Instead of coming out like a proper, curtious woman should, she sent her father, who, after listening to Junior's request, pulled him up by is collar, threatening him. Since Junior, of course did not give in to such a dirty Greenwood, he heroically and rightfully resisted, whereupon Oscar punched Junior's lights out. Now, I do not know what Junior would want from one of those muddled and unpure Greendwood lasses, but punching somebody's unconscious without provocation is not the way to treat another villager. Therefore Oscar will be detained and put on trial for his crime as soon as possible. But there are few punishments harsh enough for such an insult to our clan. Disgraceful Greenwoods. They are a shame to our village.",
        "You look at the smith being escorted away towards the village center. Of course, only a Greenwood could have committed such a disgusting action. Who the hell do they think they are attacking a Mountainspring. Especially the son of our clan's leader. This is proof they are just a bunch of low lives without any manners. All they know is stabbing people in their backs and using any opportunity to take advantage of you. Pigs!",
        "As expected of a lowly Greenwood. Just letting out the misery of their lives onto anybody that comes along. Disgusting!",
        "You have seen enough and go back.",
        "You return to the butcher, facing Carla with a defiant look. ",
        "As if you have any reason to be mad about anything. Your clan has just once again proven its worthlessness.",
        "You put three Bitcoin on the counter, snatch the chicken and head towards the door that leads to the big, cobbled street to the Southern gate. Trying to walk as straight and confident as possible, you leave the shop. All the way to the door you feel two scorching coals burning into your back, but somehow you make it outside alive. Phew, that was scary. In the end, these Greenwoods showed what they are capable of last night and Carla had a knive in her hand. You could have ended up finely chopped up, Stoooooooop! Don't even think about it. These Greenwoods should not even dare touching any Mountainspring. And they definitely won't after they here Oscar's punishment. In the end, the mayor and judge at the trial is none other than Arthur Mountainspring, Eric's younger brother and Junior's uncle."
      ],
      [
        "Who cares about errands? There finally seems to be something exciting going on in this town. You start running after Erin and catch up with him at the main square of the village. He is going into the annex of the small meeting hall, where the guard must be gathering right now to go on their morning patrol. You wait outside of the long, wooden building with the straw roof that serves as the office of the mayor of Elsberry and if necessary hosts big village gatherings. You were allowed to come a few times before and the last time even as a full member. You kept quiet for most of the meeting though. It is not like there is anything important to say in the first place. What do you care about how to protect the village from robbers and deserted soldiers? It's not like that would ever happen. Now, Erin comes out of the annex again, followed by all four guards in full uniform. Erin seems to think himself the most important man in the world as he is guiding them into the South-Western quarter. You walk next to him and try to seem as desinterested as possible to not feed this undeserved feeling of self-importance.",
        "Hey Erin, what happened?",
        "Last night, Eric Jr., the son of our clan's leader, went to pay a friendly visit to the Oscar Greenwood's daughter. Instead of coming out like a proper, curtious woman should, she sent her father, who, after listening to Junior's request, pulled him up by is collar, threatening him. Since Junior of course did not give in to such a dirty Greenwood, he heroically and rightfully resisted, whereupon Oscar punched Junior's lights out. Now, I do not know what Junior would want from one of those muddled and unpure Greendwood lasses, but punching somebody unconscious without provocation is not the way to treat another villager. So now we are going to arrest that piece of horseshit and put him on trial. But there are few punishments harsh enough for such an insult to our clan. Disgraceful Greenwoods, they are a shame to our village.",
        "You have reached the small square that is at the center of the South-Western quarter and the guards and Erin move towards Oscar's door. Oscar is by far the best smith far and wide, but your father does not trust him, which is why he always buys from Tarik, the sad excuse for this profession living in the South-Eastern quarter. But now Oscar has delivered more than justification for your dad's prejudices. Of course, only a Greenwood could have committed such a disgusting action. Who the hell do they think they are attacking a Mountainspring? Especially the son of our clan's leader. This is proof they are just a bunch of low lives without any manners. All they know is stabbing people in their backs and using any opportunity to take advantage of you. Pigs!",
        "You see Erin knocking on Oscar's door who opens and after recongizing the blond boy and the four guards behind him, turns red with anger. You can't understand what they are saying, but suddenly the smith's expression changes and he lets the guards grab him and escort him away. Or at least they try to. It's not like they could really do anything to stop him, if he decided to resist. But the massive mountain of muscle that makes up this disgusting man calmly walks in their middle with a mix of anger and superiority on his face. Well that will change as soon as he is put on trial. In the end, the mayor of this village and judge of every criminal action is Arthur Mountainspring, Eric's younger brother and Junior's uncle. His punishment will be harsh, just as he deserves.",
        "You have seen enough. Better get back to your errands before somebody sees you and tells your father. The butcher is on this square."
      ],
      [
        "You go to the small door of the butcher shop. You have probably already spent too much time on Greenwood territory today to  not to get taunted for it by your friends tonight in the tavern anyways, so you don't have to worry about that anymore. Not that you would want to spend any time with them, if you would not get taunted, of course. Greenwoods are dirty bastards that can not be trusted; every Mountainspring that is clear in their head knows that. With these thouhgts on your mind, you enter the place of the butcher and his wife. The ground floor has two entrances, one from the small square that you just entered through, and one leading out to the main road to the Southern gate. The butcher's wife is standing with roled up slieves behind the counter, looking at you as you come in. She must have seen you coming. Probably observing what's going on outside. Typical Greenwood, sees one of her fellow clan members in trouble, but just watches instead of doing something about it. As soon as she recognizes you her expressions turns into in angry glare as she opens her mouth to speak with obvious animosity.",
        "And what do you want little Mountainspring?",
        "My Father has sent me to buy a chicken.",
        "Has he now? So why should I care that he has sent you. Do you have any intention of actually buying one as well?",
        "I don't understand what you mean. Didn't I just say...",
        "Listen little dipshit, if you come in here with your nose high like that and completely full of yourself, I don't want to see you any longer than necessary to get your money. So just say: I want to buy a chicken. I want to buy a chicken.",
        "Okay, okay. I want to buy a chicken.",
        "Now there you go little Mountainspring; that'll make 6 Bitcoin.",
        "Wait, wait, wait. That is two times more than last time. Last time I came here it was 3 Bitcoin. Why am I suddenly supposed to pay 6? I demand an explanation.",
        "You want an explanation? Then go to that door and take a little look outside. That's why.",
        "As if you have any reason to be mad about anything. Your clan has just once again proven its worthlessness.",
        "Your scared out of your mind to talk back on somebody older than you, especially if that person has a butcher's knife in their hands. You put three Bitcoin on the counter, snatch the chicken and head towards the door that leads to the big, cobbled street to the Southern gate. Trying to walk as straight and confident as possible, you leave the shop. All the way to the door you feel two scorching coals burning into your back, but somehow you make it outside alive. Phew, that was scary. In the end, these Greenwoods showed what they are capable of last night. You could have ended up finely chopped up with that butcher knife, Stoooooooop! Don't even think about it. These Greenwoods should not even dare touching any Mountainspring. And they definitely won't after they hear Oscar's punishment. In the end, the mayor and judge at the trial is none other than Arthur Mountainspring, Eric's younger brother and Junior's uncle.",
        "You got the chicken. Next up: the herbalist across the street."
      ],
      [
        "You cross the road and walk towards the house of the herbalist. A middle aged woman by the name of Rachel, brown hair, rather slim with a confusingly big nose, the clear sign of a witch. She only came to this village three years ago and set up shop in one of the abandoned houses in the South-East Quarter right along the big road that leads to the Southern gate. Nobody really trusts her, because of course you never know what these witches are brewing in their cauldrons at night. Your family, however, has become too dependent on her not to award a little bit of trust. Since your mother got very sick two years ago, you have been making trips to this house every few weeks to get medicine. Rachel always seems to be very concerned, but, in the end, if she really cared, she would have come to see your mother herself and cured her properly with her witchcraft instead of always just sending some herbs. Damn her. ",
        "You see the smoke already coming out of the chimney in the roof and as soon as you enter, the smell of green from all the herbs almost overwhelms you. Rachel is in the back, right corner, next to the fire, stirring something inside a cauldron.",
        "Wait a second, I'll be right there.",
        "You take a look around. Everytime you come here, you find some new interesting thing that is worth inquiring. This time it is a gigantic book on the counter. You go closer and take it into your hand. The weird letters in the front still don't make any sense to you. How much you wish you could read. But father says, there is no time for such nonsense, so you spend your days running errands and taking whatever small jobs are offered around the village. In the winter, that amounted to a looooot of wood chopping. You try to open the book, but in that moment, Rachel nabs it out of your fingers and places it in a shelf behind her.",
        "That is for another day, Taurin. For now, I presume you have come again for the medicine? Here, I thought you'd run out soon, so I have already prepared the package for you. How is your mother doing? Any change of her symptoms?",
        "No not really, she still lies in bed all day, looking at the ceiling, barely hearing what we say. The fever from the beginning is gone, but she still barely sleeps or eats. Nothing is getting better, things are only ever getting worse. And your herbs don't help at all. We give them to her and nothing happens. It has been two years!!! And she is not getting better. My little sister has to do all the household chores. And she is fourteen. This just isn't right...",
        "As you were talking you got more and more upset, raising your voice to almost shouting. Now, there she is again with that weird look in her eyes. Who does she think she is? You know that she could save your mom with her witchcraft, if she just wanted to. It's her fault that your mom is still sick and getting thinner and thinner. It's her fault that your mom will die.",
        "I am very sorry for you, Taurin. I promise, if your mom will keep taking these herbs, things will get better eventually. Please...",
        "A little bit angry, but mostly sad, you slam a some of the money your father gave you on top of the counter and grab the package. Next time, you will ask her to come see your mom for sure. Next time, you will and then she has to come. Next time. You turn around to leave, trying to hold back the tears.",
        "Oh and Taurin, do you have any idea what is going on in the South-West quarter? I've seen people run over there and back for the entire morning, something serious must have happened. I have to watch the fire here for a few more hours. If you find out what is going on, will you come by and tell me?",
        "Oscar attacked Junior last night unprovoked, and they arrested him a few minutes ago. Dirty bastard. He's gonna be put on trial and get what he deserves. Miserable Greenwood. Never up to any good.",
        "Rachel looks like she wants to say something, but then stays silent and waves you off, you can't recognize the expression on her face, but she seems to be lost in thoughts.",
        "You turn around and leave for the outside world again. The sun is starting to break through the clouds above and it is getting warmer. Your body is finally not so stiff from all the cold anymore. Last one: the Smith"
      ],
      [
        "You enter the South-Eastern quarter and start walking between smaller, somewhat run down houses. There is nothing much here except for the herbalist, tailor, and the mill. Oh and of course that second rate smith Tarik that you are going to right now. Everybody knows that Oscar Greenwood is a much better craftsman, but of course he is a Greenwood. And one cannot trust a Greenwood. That is what your father and Eric have taught you from when you were a child. They cannot be trusted. You keep moving, kicking up dust from the narrow lane that you are walking on. In the background, you hear some chickens cackling, as you arrive at Tarik’s house. To your dismay you see that the fire has not been started yet and its owner seems to still be asleep. But you get lucky and right when you decide to turn around, the tall man with his gigantic beer belly walks out the door.",
        "Is that you Taurin? What do you want?",
        "Father sent me to collect an order that was supposed to be done today.",
        "Right, right that thing. Well, it’s not done yet. Come back later, there is still some stuff to do.",
        "But...",
        "No buts. I told your father it would be done today and it will be done today. But not so early in the morning.",
        "Still squinting due to the brightness of the sun, you see him going to work and starting up the fire. A little annoyed, but powerless, you turn around and grumble something about why you have to get up so early, when other people don’t do either. What a waste of time! Well, everything else is done, so you guess you might as well go back home. But not through these shady side streets, the main roads have a lot more sun. You make your way back to the cobbled street and enjoy a quick break letting the sun shine in your face. Ahhh, that feels good."
      ],
      [
        "The chicken has to go home, so that Sophie can start prepping it for dinner. You start heading up the big cobbled street towards the town square. From further away you see Thomas, the hunter, coming towards you. It is not entirely legal to hunt in the forests around the village, because it all belongs to the Duke, but since none of the villagers say no to some extra meat, nobody would ever betray him to the authorities. You have spent quite a bit of time with him over the past few years, so you can recognize his big brown leather jacket and gigantic dark mustache from far away. As long as you have known him, Thomas has lived alone. You tried to ask him a few times, why he does not find himself a wife to take care of the household for him, but he never gave you a satisfying answer. One time, after he had a couple of drinks he just looked at you and you could see the tears starting to fill his eyes. That is when you stopped asking him. He is a honest guy that despite not belonging to a clan is at least not hated by anybody in the village. You envy him a bit for his freedom to do whatever he likes, not having to always think about the reputation of the 'Mountainspring Blood'. Your dad goes on and on about this stuff every day, so you have gotten quite tired of hearing about it. But then again, better a Mountainspring than a Greenwood. Fucking bastards. Thomas is now quite close and gives you a small nod as a greeting.",
        "Have you heard what happened? Oscar punched Junior unconscious last night and is now being detained and put on trial. We are going to get him back for what he did to the son of our leader and the nephew of our mayor! That will at least be some torture.",
        "Is that so? That does not really sound like Oscar. Why would he go so far as to punch somebody unconscious that is clearly weaker than him?",
        "Are you trying to insult us? Ah, no you would not. I guess, you are right, Junior is a little bit weaker. Hah, but if there would have been more of us, Oscar would not have stood a chance. But apparently, Junior just wanted to have a nice little meeting with the Smith's daughter. I have to admit, she is quite the pretty little thing. But in the end, a Greenwood girl is not worth more than a handful of dirt, no matter how pretty she is. Anyways, that is no reason to punch somebody's lights out. What do you think?",
        "I think, you are not getting the whole story here. Oscar is a calm guy, if he actually did what you said he did, something must have made him pretty angry. Maybe you should hear his version of the events as well, before you come to a judgment.",
        "What are you trying to say? That I should not trust the word of my own clan members and instead listen to a lowly Greenwood. No way. They can not be trusted. I have known that since I was born. And everybody says it as well.",
        "No, no, I am not saying that you should not trust your friends and elders. But that does not mean that you can take everything that they have given and told you for granted. If you just accept everything that the people around you believe, you will also accept a lot of bullshit. Just because everybody around you says something is true, does not make it automatically true. It is your responsibility to think by yourself and come up with your own judgments. You have the power to decide how to interpret what you see and hear. Everybody has that power. You can decide your truths, values and principles. It is your responsibility to reflect on what you have learned throughout your life and check for anything that does not serve you. You have been taught from your earliest days that Mountainspring blood is pure and sacred. That Mountainsprings are something better, just as Greenwoods are lowly creatures that bring nothing but misery. But do you truly know that this is true? You are the master over your interpretations of reality. You have the power to decide. And therefore you have the power to cast away what is useless. Do you really think such a hatred of an entire group of people just because of their clan is serving you? Do you really think, believing every word of a person, just because he is part of your clan is useful? You have the power to decide.",
        "And just like that he keeps walking towards his little hut at the end of the street and leaves you there, standing in the middle of the street. What does he mean by: I can decide? Why would I need to decide?"
      ],
      [
        "Still not entirely clear about what you just heard, you remember the dead chicken that you are still holding under your arm. You slowly start moving towards your house again. Lost in thought, you barely notice what is around you. You cross the big square in the center of the village, which is now a bit busier, but still far from full. A delicious smell of food hits you from the tavern that you now walk around, making your stomach grumble. Ah how you miss your Mother's cooking. Of course, Sophie is doing her best, but it is just not the same. You head down the small streets between the houses of the North-Western quarter towards your house. Turning around a corner, you suddenly stand in front of your best friend Peter, who looks everything else but good. His face is completely white and his eyes keep darting around. As soon as he notices you, he jumps back a bit, but then relaxes and leans against the wall.",
        "Ah, it's just you Taurin. Carrying around a dead chicken? Don't tell me you went to that lousy Greenwood butcher?",
        "And what if I did? You know what, I actually saw something quite interesting down there. The village guards were detaining Oscar for punching Junior k.o. last night. Crazy, right? What the hell was that stupid Greenwood thinking?",
        "What?",
        "Yeah apparently, Oscar got super violent after Junior just asked to pay a visit to his daughter. Even though, actually Thomas just said...",
        "Peter seems to have grown more nervous again. He grabs you by the shoulders and pushes you into the shadowy area of the small street. ",
        "That is not what happened. Well kinda, but not really. Taurin you got to listen...",
        "He opens his mouth to continue, but then seems to reconsider and closes it again, looking away to the side. ",
        "Ah, nevermind. Forget what I just said, okay?",
        "Wait, what do you mean by that is not what happened?",
        "I just told you to forget it, alright? You have to promise to tell nobody about what I just said, okay? I promised Junior, otherwise...",
        "Calm down Peter. It's okay. It's just me, you know, Taurin, your best friend. Now, you come on, tell me what's up. ",
        "But Junior said that if I tell anybody what really happened, he'll tell Eric that I am lying. And then Eric will kick me out of the clan and then nobody will care anymore what happens to me and then my life will be horrible and I will starve somewhere in the forest...",
        "Wow, wow, wow. Slow down a little. None of that will happen. If you just tell me it will be alright. And if Junior makes trouble, we'll just mess him up a bit. In the end, even a lowly Greenwood was able to beat him.",
        "Taurin, I'm not sure. But I guess, if it's only you, I will be okay. Junior wouldn't mind you knowing anyways probably. So this is what happened: You know how we went to the tavern yesterday and got pretty drunk? Well, at some point Oscar's daughter walked past, a pretty little thing, and Junior decided to take a shot at her. He went out of the tavern and asked her to come in for a drink with him. After she refused, he got a bit rougher, doing the whole 'do you know who you're talking to' number, so she got scared and ran. He went after, but was too drunk to run, so he didn't catch her before she reached the house. I went after him to get him back inside and keep him from doing anything stupid, but he was dead set on getting that girl into the tavern. When we arrived at Oscar's place, she must have already told the smith about everything, so when Junior knocked on the door, he came out with a pretty angry expression on his face. Junior seemed to be completely unaware of this and told the smith to get his daughter down so they could have a fun time. Oscar said, that she didn't want to have anything to do with Junior, so Junior got angry. He said, well if she doesn't want to, I guess I'll have to force her and tried to march past him into the house. That's when Oscar grabbed Junior and told him to leave right now, but Junior resisted screaming that a dirty Greenwood does not have the right to touch a Mountainspring such as him. He said, you Greenwoods don't understand anything but force anyways, so that is what he is going to use on Oscar's girl. That he was gonna take her, whether she wanted or not. That is when Oscar got really angry and punched Junior right in the face. Junior just fell right backwards onto the street. He just lay there, not moving. It was super scary. I ran over to him and he had blood all over his face. For a moment, I thought he was dead, but then I saw his chest moving to breathe. I tried to apologize to Oscar about what happened, but when I saw his face, I froze. Man, that guy can be scary. He went back inside and slammed the door behind him, leaving Junior and I on the street. Since Junior was still unconscious, I tried to carry him back to his place, but man that guy is heavy. So I just put him down in one of the side streets and waited for him to wake up. Then we walked back together to the North-Western quarter, but he told me to leave him be before we reached the main square. He made me promise to not tell anybody about what happened and then left for his house. I was too scared to do anything for the rest of the night, so I just went home. And now they have arrested Oscar for attacking Junior unprovoked. But it wasn't unprovoked. As much as I despise those Greenwoods, I can understand why Oscar did it. This just is not fair.",
        "But who cares, nothing is gonna change for us and a Greenwood's life is miserable anyways. Whatever they are gonna do to him, will not make things worse.",
        "Right, who cares, if a Greenwood will get a bit hurt. That has nothing to do with us. Well see you later. We'll have a quite a bit of a spectacle, huh?",
        "See you later Taurin. Yeah, right, a spectacle. It will be fun.",
        "This is not right. As much as I hate to say it, Oscar has done nothing wrong. And they are gonna punish him really bad. We have to do something about it.",
        "I'll bring the chicken home and meet you at your house, yeah? And Peter, calm down, we'll be fine. But we can't just let this happen.",
        "I guess you are right. We have to do something. See you soon."
      ],
      [
        "With the chicken under your arm, you make yourself on the way back to your house. Why did Peter have to tell you this? But who cares. No need to worry about a Greenwood. All they deserve is misery anyways. You kick up some dust on the street you are walking on and pass onto the small square at the center of the North-Western quarter. Suddenly the door of the clan leader's gigantic house swings open and the boulder of a man himself emerges into the outside. Eric Mountainspring, with his long brown hair and elegant blue cloak, starts walking across the square with a conviction in his steps that would make anyone cower out of his way. He notices you and gives you a friendly nod.",
        "You try to mirror his nod, but end up making a small bow. There is just no way that that man and you are equals. You keep walking toward your house and enter the living room, where your little sister is sitting next to the stove, stitching some old clothes.",
        "Taurin, you're already back! Do you have mothers herbs? She really needs the medicine, but I used everything up yesterday.",
        "Yes, of course, here you go! And the chicken as well.",
        "Sophie takes the herbs and chicken out of your hand and looks at you concerned. Do you still look unsettled from what Peter told you? You should just forget what you heard.",
        "Are you alright, Taurin? Did something happen?",
        "I'm alright, but something did happen. They arrested Oscar, the Greenwood blacksmith, for attacking Junior last night without any warning. Such miserable lowlives, these Greenwoods.",
        "Oh no, is Junior alright? Who would do something like that?",
        "Funny, in all this time, you have not given a single thought to how Junior was doing. But then again that snake didn't deserve any concern. The clan was going to do poorly when he would be in charge. ",
        "I don't know how Junior is doing. But I know who would do something like that: a Greenwood. Lashing out their desperation on anybody who comes along. But enough of this. They're gonna give him a trial and the Greenwood will be punished. ",
        "Sophie nods and turns away to prepare the herbs for your mother. You have started feeling hungry for some lunch, so you go over to the cupboard and grab yourself some bread and slice of a small chunk of cheese. As you munch on the hard bread, Sophie disappears upstairs to give your mother her medicine. You think about following her for a second, but decide not to. For some reason, you are scared to look at your mother. Everytime you see her frail body, sunken in eyes and hollow cheeks, it scares the life out of you. All you want is for her to be back to normal. But that annoying witch just won't come over and heal her properly. Next time. Next time, you'll ask her to come. Lost in thoughts, nibbling on your food, time flies by.",
        "Suddenly your father breaks through the door. With his back against the light, you can't read his expression, but the way he slams the door shut behind him and stomps over to the food cupboard, can not mean anything good. Why is he here? He should be out for the entire day, overseeing Eric's fields. When you were still a child, your father still worked in the small glass factory up in the North-Eastern quarter, but after an accident, he suddenly refused to go back to work there. Physically he seemed to be completely fine, except for the few scars from glass cuts that everybody gets with the time working there. You tried asking him about it several times, but never got an answer from him. Usually, you just got told to shut up, sometimes you would be chased out of the room, being threatened to get a proper beating. Somehow the clan leader had taken pitty with your father and given him the job of overseeing his fields surrounding the village. Beforehand, Eric had simply done that himself, so the position did not really exist, but it gave your father work and money to bring home which got more important when your mother got sick and could not help out anymore either. Without Eric, your family would probably quite soon run out of things to eat and would have to depend on donations to stay alive. But still why was your father here? Suddenly your old man disrupts your thoughts, starting to speak in an upset voice.",
        "Have you heard? That piece of shit Oscar hit Junior in the face last night. Just like that, out of the blue. Passed right out. Miserable Greenwoods. How dare they just start attacking people like that? Especially the great Mountainspring clan leader's son. They hate us I tell you. And they hate us because they know we are better than them. They would find any excuse to let out their feelings of inferiority on us, who have done nothing wrong. They can not be trusted, seemingly not even enough to come within an arms length of them. Luckily Junior is alright, that Greenwood smith is a mountain. Do you see now why I sent you to Tarik instead? Disgusting Greenwoods. What do you think, son?",
        "Absolutely. We should just throw them all out of the village. Would become a lot nicer here, if they weren't constantly muddling our air by daring to breath. When I went to the butcher earlier, I almost left running because of their stench.",
        "You're right, it would be better if they were all just gone. But today, we shall start with that smith. Eric called us back early, because he wants to have the trial this afternoon and we should all come and watch. I guess, he does not want to waste money on serving that piece of shit food while in sitting around all day in a sell. Such a wise man! You see, he is example of a man that cares about the people around him. Greenwoods on the other hand, just think of themselves and if their urges overcome them, all you can do is knock them out. ",
        "So the trial will already be this afternoon. That is quick. But as your father said, better not waste money while he sits in his cell waiting. This will truly be a spectacle.",
        "How are your chores coming along?",
        "I got the herbs from Rachel. She is cooking up some potion in the back of her house that I don't like at all. Stupid witch. I also got the chicken from the butcher and of course that Greenwood tried her best to threaten and then overcharge me. Miserable Greendwoods! Even Tarik let us down. I came in the morning and he had not even started working. Said to come back later",
        "Well then go to that damn Tarik again and get our order. And I just saw we are almost out of bread so go fetch some of that for us too the money you have left should be enough for a loaf right?",
        "Yes, father.",
        "You both finish up your meal and you see your father climbing up the stairs, most likely to look after your mother. You turn towards the door with a sigh and get on your way again. Whatever your father said, that is what you would do. That is just how it was. Boring, but who are you to be able to change it. Some other boys were able to start an apprenticeship in another village, but he had to stay here and help with running the household since your mother was sick. So half of the time, you spend walking around the village running errands and the other half you spent dozing around with Peter, or helping out other people around the village, sometimes even for a small reward. After opening the creaking door, you find yourself blinded by the sun, which has burned its way through the clouds and now gleams with warming light. It truly is spring. You move your tired limbs around a bit in the sun and then get on your way.",
        "Where to next: the Baker or try the smith again?"
      ],
      [
        "The bakery it is. You move inbetween the small houses of the North-Eastern quarter to get back to the central square. Since the sun is standing so high now, there is barely any shade and you fill your money happily taking in the light. Oh, how you love lying around in the sun in the summer. Sadly, since your father had become overseer of Eric's fields, your family now also had to help with the harvest. This meant that every summer now was filled with hard work and your time spent relaxing in the sun was significantly limited. Such a drag. The village bakery is located right at the big central square on the side of the North-Western quarter. It is one of the few stone houses in the village, but considering that there is a gigantic oven burning inside every day, it made sense to have a bit more fire resistant material. You do not really like the baker. He was neither a Greenwood nor a Mountainspring and had so far never taken any sides in the hostilities between your honorable clan and those dirty Greenwoods. He just sold bread to anybody who could pay. Can't he see that these Greenwoods were nothing but disgusting runts. Well, you are sure that if he hears what happened last night, he will change his mind. Except it didn't. The attack was not unprovoked...    Forget that, Taurin. Just forget, Peter ever told you about that. Junior was unprovokedly attacked by a dirty Greenwood bastard and that was it. You have arrived at the central square and turn towards the bakery. As you open the door, the smell of fresh bread hits you. It is one of your favorites. The baker looks at you with a slightly annoyed face, as though you have disturbed his peace, sitting behind the counter. Isn't he supposed to be happy to have a customer?",
        "Ahhhhh, Taurin. What can I do for you today? Just one loaf of bread as usual?",
        "Yes, one loaf of bread, that's all for today. Have you heard what happened? Oscar is being put on trial for unprovokedly attacking Junior last night.",
        "Of course, I have heard. But if you think you can pull me into your dirty game of politics, then you are dead wrong. You Mountainsprings out there have your little witch hunt. I will stay right here, where I am.",
        "You had expected something like that, but not willing to risk any confrontation, take the bread, put some money on the counter, soak in the smell of fresh bread one last time and leave the bakery. Back out on the main square you already see people moving in and out of the small town hall, building up something like a podium on the big square. They really must want everybody to come, if they do not think that the town hall itself will be big enough. Well, if you have a spectacle, then at least get as many people as possible to see it. And the more people realize how dirty and disgusting the Greenwoods are the better. Unprovokedly attacking a Mountainspring, everybody has to learn what consequences that has. You wait for resistance in your brain to tell you that the attack was not unprovoked, but none comes. Seems like the new story you have been telling others has taken hold of your brain again as well. Who cares about the truth, this makes more sense. Greenwoods are miserable creatures. It fits perfectly for them to do something as stupid and offending as this. With the loaf of bread in your hand you start walking toward Tarik's workshop again. With the sun in your face as you walk toward the South-Western quarter, you start to smile and whistle a small tune. You walk back into the shade of the small streets and kick up dustclouds from the tiny alleyway. Some of that gets on your jerking and makes it dirty, so you stop again, getting annoyed. As you arrive at Tarik's house, your good mood is already gone again. Tarik is not outside smithing, even though the fire is still crackling away. You go up to the door and knock. After a few seconds, his wife Martha opens the door and looks at you with a disgruntled face. You knew that had not necessarily something to do with you, Martha was just almost upset about something and held nothing back in letting her dissatisfaction out on anybody who came along. ",
        "What do you want? I don't have time for you kids' shennanigans, right now.",
        "I am not a kid anymore! I was sent by my father to collect an order from your husband. Is he home?",
        "Of course he is home. Do you really think that that lazy bugger would ever move his ass further than the porch. He's on the other side of the house, being lazy as usual.",
        "Thank...",
        "Before you can finish your sentence, Martha has already slammed the door closed again. You don't like her. In fact, nobody in the entire village likes her, but what could you do. Now more than slightly annoyed, you walk around the house. The fire is still very hot as you pass it, to the point where you feel uncomfortable and try to get away as quickly as possible. There is about one to two meters of space between the backside of Tarik's house and the rotting wall of wooden pikes that had been built even before you were born. He never found out what this village had to protect itself from to build a two meter high fence of 40cm thick trunks, pointed at their tops. Nothing exciting, let alone dangerous ever happened here unless caused by the victims own stupidity and lack of carefulness. Now the trunks of the wall are rotting away, looking like the logs would break on their own at any time, even without any intervention from outside attackers. Inbetween his house and the wall, Tarik had built a small podium that let him see beyond the fence and was equipped with a chair. On that chair he sat, lounging in the sun while drinking a beer from an enormous wooden mug. It looks quite comfortable. ",
        "Tarik, have you finished my father's order now?",
        "Tarik slowly turns towards you, takes a sip from his mug and looks at you annoyed. ",
        "Have you once again come to pester me? Yes I have finished, otherwise I would not be relaxing here. I've wrapped it and put it on the small table next to the fire. You can get it yourself.",
        "He turns his face to the sun again, closing his eyes.",
        "Have you heard what happened? They arrested Oscar for unprovokedly attacking Junior last night. They are gonna put him on trial this afternoon. We're gonna get back at them for what they have done to one of us. Miserable Greenwoods.",
        "Is that so? ... Mhhh, now that sounds interesting. Maybe I will come as well. Curious to see what they will do to that bugger. Always pretending to be better than anybody else. Seems like this time it got him into pretty deep trouble. Well, if what you say is true, he more than deserves whatever his punishment will be. ",
        "And his punishment will be bad. We can not forgive someone who unprovokedly attacks another villager, especially not the son of the great Mountainspring clan's leader himself.",
        "Tarik looks away as if in deep thought. You stand there for a few more seconds, unsure what to do, but then turn away and go back to the fire. Indeed, there is a bundle of dirty cloth and as you lift it with something quite heavy inside. Metal pieces seem to clink against each other as you throw it over your shoulder. Bread in one hand, mysterious metal construction in the other, you start going back home once more. The life of an errant boy: a lot of walking combined with a lot of boredom. Well, at least today, for the first time in your life something exciting is about to happen."
      ]
    ]
